In [1]:
import pandas as pd

In [3]:
data.head(3)

         date  week  address  count
0  2015-08-01     6      121  22628
1  2015-08-01     6      123   9056
2  2015-08-01     6      125  19838

In [4]:
len(data)

2440

In [8]:
data.to_excel('Acc.xlsx',index=None)

In [11]:
dfAll = pd.read_table('./part-r/part-r-all',sep=',',names=['date','week','address','count']) #每两小时

In [12]:
dfAll

                date  week  address  count
0      2015-08-01-13   129        6    832
1      2015-08-01-22   155        6    186
2      2015-08-02-10   129        0    783
3      2015-08-02-13   129        0    688
4      2015-08-02-15   127        0   1120
...              ...   ...      ...    ...
44099  2015-11-28-17   131        6   1376
44100  2015-11-29-17   131        0   1656
44101  2015-11-30-05   149        1      6
44102  2015-11-30-10   139        1   1290
44103  2015-11-30-13   133        1   1151

[44104 rows x 4 columns]